Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/tm/cuspy-level1.tmx
Source language: en_gb
Languages: fr_fr

source: However, the most common situation is that new data is added to the system.
fr_fr: Cependant, la situation la plus habituelle est que des nouvelles données soient ajoutées au système.

source: However, the package :mod:`cuspy` does not offer all the functionalities of PEST++ and :mod:`pyemu` (for example, tied parameters are not supported).
fr_fr: Cependant, le paquet :mod:`cuspy` n'offre pas toutes les fonctionnalités de PEST++ et de :mod:`pyemu` (par exemple, les paramètres liés ne sont pas supportés).

source: However, they require a much higher number of simulations, which may be prohibitive if the model run time is large.
fr_fr: Pourtant, elles requièrent un majeur nombre de simulations, que peut être prohibitif si le temps d’exécution du modèle est élevé.

source: However, this only happens if the measure is of the right type.
fr_fr: Cependant, ça ne s'avère que si la mesure est du type correcte.

source: However, this threshold might not be appropriate, since we expect the residuals to be correlated.
fr_fr: Cependant, ce seuil pourrait ne pas être approprié, car on espère que les résidus soient corrélés.

source: Ideally, with time, we may reduce the uncertainty of simulations by improving our understanding of the system (adapting the structure of the model according to the available data), by reducing measurement error (with more precise data) and by identifying more precisely the value of the parameters (with more and more precise data).
fr_fr: Idéalement, après un certain temps, on peut réduire l'incertitude des simulations par l'amélioration de notre connaissance du système (en adaptant la structure du modèle d'après les données disponibles), par la réduction de l'erreur de mesure (avec de données plus précises) et par l'identification plus précise des valeurs des paramètres (avec plus de données et données plus précises).

source: Identifiability
fr_fr: Identifiabilité

source: Identifiability can also be analysed by visualizing the model's response surface with real or synthetic data.
fr_fr: L'identifiabilité peut être analysée aussi par la visualisation de la surface de réponse du modèle avec des données réelles ou synthétiques.

source: Identifiability can also be assessed using sensitivity analysis tools.
fr_fr: L'identifiabilité peut être évaluée aussi avec des outils d'analyse de sensitivité.

source: Identification of the model structure and parameter values
fr_fr: Identification de la structure du modèle et des valeurs des paramètres

source: Identifying the place with a sharp elbow.
fr_fr: Identifier le point avec un angle marqué.

source: If 'default', observation names have the format "xxxx_YYYYmmdd" (xxxx is the corresponding variable name, and YYYYmmdd is a date string).
fr_fr: Si c'est 'default', les noms des observations ont le format "xxxx_AAAAmmjj" (xxxx est le nom de la variable correspondante, et AAAAmmjj est une chaîne de caractères qui représente la date).

source: If 'default', observations are grouped by variable name.
fr_fr: Si c'est 'default', les observations sont groupées par nom de variable.

source: If 'default', observations names have the format xxxx_YYYYmmdd (xxxx is the corresponding variable name, and YYYYmmdd is a date string).
fr_fr: Si c'est 'default', les noms des observations ont le format xxxx_AAAAmmjj (xxxx est le nom de la variable correspondante, et AAAAmmjj est une chaîne de caractères qui représente la date).

source: If 'default', prediction names have the format "xxxx_YYYYmmdd" (xxxx is the corresponding variable name, and YYYYmmdd is a date string).
fr_fr: Si c'est 'default', les noms des prédictions ont le format "xxxx_AAAAmmjj" (xxxx est le nom de la variable correspondante, et AAAAmmjj est une chaîne de caractères qui représente la date).

source: If 'default', predictions are grouped by variable name.
fr_fr: Si c'est 'default', les prédictions sont groupées par nom de variable.

source: If :math:`S_{T_i}=0`, the parameter :math:`X_i` is noninfluential.
fr_fr: Si :math:`S_{T_i}=0`, le paramètre :math:`X_i` n'a aucune influence.

source: If None, parameter covariance is estimated from parameter bounds.
fr_fr: Si None, la covariance des paramètres est estimée depuis le rang de valeurs des paramètres.

source: If None, predictions are read from the `pst_file0` as the observations with null weight.
fr_fr: Si None, les prédictions sont lues depuis le fichier `pst_file0` comme observations avec un poids nul.

source: If None, the parameter group names are the same as the parameter names (one parameter group for each parameter).
fr_fr: Si c'est None, les noms des groupes de paramètres sont les mêmes que les noms des paramètres (un groupe de paramètres pour chaque paramètre).

source: If a the response of a model is insensitive to a parameter, the parameter is unidentifiable.
fr_fr: Si la réponse d'un modèle n'est pas sensible à un paramètre, le paramètre n'est pas identifiable.

source: If an uncertainty file is not provided, parameter uncertainty is estimated from the parameter bounds by assuming the interval covers 4 standard deviations.
fr_fr: Si un fichier d'incertitude n'est pas donné, l'incertitude des paramètres est estimée depuis les limites des paramètres en supposant que l'intervalle couvre 4 déviations standard.

source: If an uncertainty file is not provided, they are understood to represent the 95% confidence interval (a width of 4 standard deviations) [#third]_ of the parameter value.
fr_fr: Si un fichier d'incertitudes n'est pas donné, ils représentent l’intervalle de confidence du 95 % (une largeur de 4 déviations standard) [#third]_ de la valeur du paramètre.

source: If an uncertainty file is provided [#second]_, they represent the minimum and maximum values that the parameter can take.
fr_fr: Si un fichier d'incertitude est donné [#second]_, ils représentent les valeurs minimales et maximales que le paramètre peut prendre.

source: If another str, all observations are assigned to the same group.
fr_fr: Si c'est une autre str, toutes les observations sont assignées au même groupe.

source: If another str, all predictions are assigned to the same group.
fr_fr: Si c'est une autre str, toutes les prédictions sont assignées au même groupe.

source: If another str, the observation names have the format "obs_namesNN", where NN is the index of the observation in the resulting dataframe.
fr_fr: Si c'est une autre str, les noms des observations ont le format "obsnamesNN", où NN est l'index de l'observation dans le dataframe créé.

source: If another str, the observation names have the format obsnamesNN, where NN is the index of the observation in the resulting dataframe.
fr_fr: Si c'est une autre str, les noms des observations ont le format obsnamesNN, où NN est l'index de l'observation dans le dataframe créé.

source: If another str, the prediction names have the format "pred_namesNN", where NN is the index of the prediction in the resulting dataframe.
fr_fr: Si c'est une autre str, les noms des prédictions ont le format "pred_namesNN", où NN est l'index de la prédiction dans le dataframe créé.

source: If float, it indicates a weight to apply to all measurements.
fr_fr: Si c'est float, il indique un poids à appliquer à toutes les mesures.

source: If it is a path, group names are read from a file with the same format and column names as `obs_file`.
fr_fr: Si c'est un chemin, les noms des groupes sont lus depuis un fichier avec les mêmes format et noms de colonnes que `obs_file`.

source: If it is a path, group names are read from a file with the same format and column names as obs_file.
fr_fr: si c'est un chemin, les noms des groupes sont lus depuis un fichier avec les mêmes format et noms de colonnes que obs_file.

source: If it is a path, observation names are read from a file with the same format and column names as `obs_file`.
fr_fr: Si c'est un chemin, les noms des observations sont lus depuis un fichier avec les mêmes format et noms des colonnes que `obs_file`.

source: If it is a path, observation names are read from a file with the same format and column names as obs_file.
fr_fr: Si c'est un chemin, les noms des observations sont lus depuis un fichier avec les mêmes format et noms des colonnes que obs_file.

source: If it is a path, prediction names are read from a file with the same format and column names as `pred_file`.
fr_fr: Si c'est un chemin, les noms des prédictions sont lus depuis un fichier avec les mêmes format et noms des colonnes que `pred_file`.

source: If models are to be used as management tools, to provide evidence on which to base decisions, it is only natural to assess their ability to simulate the behaviour of the system.
fr_fr: Si les modèles doivent être utilisés comme des outils de gestion, pour apporter de l'information sur laquelle baser des décisions, il est complètement naturel d'évaluer leur capacité de simuler le comportement du système.

source: If necessary, the other sections can be configured manually.
fr_fr: Si c'est nécessaire, les autres sections peuvent être configurées manuellement.

source: If one of those behaviours is not represented in the calibration data, there is no information to estimate the value of the parameters specifically related to that behaviour.
fr_fr: Si un de ces comportements n'est pas représenté par les données de calibration, il n'y a pas d'information pour estimer la valeur des paramètres spécifiquement liés à ce comportement.

source: If str, it indicates the path to a file with the same format and column names as `obs_file` containing weights for each measurement.
fr_fr: Si c'est str, l'argument indique le chemin à un fichier avec les mêmes format et nom des colonnes que obs_file et qui contient les poids pour chaque mesure.

source: If str, it indicates the path to a file with the same format and column names as obs_file containing weights for each measurement.
fr_fr: Si c'est str, l'argument indique le chemin à un fichier avec les mêmes format et nom des colonnes que obs_file et qui contient les poids pour chaque mesure.

source: If the coefficient of determination of the model is high (for example, :math:`R^2 \geq 0.7`), the model may be considered to be linear and the SRCs may be used for sensitivity analysis (Hall et al.
fr_fr: Si le coefficient de détermination du modèle est élevé (par exemple, :math:`R^2 \geq 0.7`), le modèle peut être considéré linéaire et les SRCs peuvent être utilisés pour l'analyse de sensitivité (Hall et al.

source: If the model does not perform well, this may indicate:
fr_fr: Une mauvaise performance du modèle peut indiquer :

source: If the model results are incoherent with the observations, it would be necessary to review the data, model structure and parameter values to identify the source of the mismatch.
fr_fr: Si les résultats du modèle sont incohérents avec les observations, il faudrait réviser les données, la structure du modèle et les valeurs des paramètres pour identifier la source du désaccord.

source: If the model structure is suitable to the modelled system, obtaining more data should result in a reduced parameter uncertainty.
fr_fr: Si la structure du modèle est appropriée au système modélisé, l'acquisition de plus de données devrait contribuer à réduire l'incertitude des paramètres.

source: If the project's documentation is updated, it is necessary to create new pot files following the procedure described above.
fr_fr: Si la documentation du projet est modifiée, il faut créer des nouveaux fichiers pot d'accord avec la procédure décrite ci-dessus.

source: If the simulated behaviour of the system is consistent with the observed behaviour, we cannot assume the model has been absolutely validated; it has only been validated for the sets of circumstances included in the calibration and validation data sets.
fr_fr: Si le comportement simulé du système est cohérent avec le comportement observé, on ne peut pas présumer que le modèle a été absolument validé ; il a été validé seulement pour la série de circonstances inclues dans les jeux de données de calibration et validation.

source: If the system is nonlinear (:math:`R^2 < 0.7`), more sophisticated (global) methods will be necessary.
fr_fr: Si le système est non linéaire (:math:`R^2 < 0.7`), des méthodes (globales) plus sophistiquées seront nécessaires.

source: If there are differences between the distribution of parameter values for acceptable and unacceptable simulations, the model is sensitive to that parameter.
fr_fr: S'il y a des différences entre la distribution des valeurs d'un paramètre pour les simulations acceptables et inacceptables, le modèle est sensible à ce paramètre.

source: If we wanted to reduce the uncertainty of winter and summer forecasts, which measurements would we need to take?
fr_fr: Si on voulait réduire l'incertitude des prédictions en été et en hiver, quels mesures additionnels devrions-nous prendre ?

source: If you do not have to compile the documentation, :mod:`sphinx` is not necessary to use :mod:`cuspy`, since a precompiled pdf copy of the documentation is included in the folder :file:`docs`.
fr_fr: Si vous ne devez pas compiler la documentation, :mod:`sphinx` n'est pas nécessaire pour utiliser :mod:`cuspy`, puisque une copie déjà compilée de la documentation en pdf est incluse dans le dossier :file:`docs`.

source: If you need to compile the documentation from source (e.g., to modify it), you will need the package :mod:`sphinx`.
fr_fr: Si vous avez besoin de compiler la documentation depuis le code source (p. ex., parce que vous avez fait des modifications), vous aurez besoin du paquet :mod:`sphinx`.

source: If you work on Linux, you need to compile the PEST++ executables.
fr_fr: Si vous travaillez sous Linux, vous devrez compiler les exécutables de PEST++.

source: Ignored if ``type = post`` (gaussian distribution used).
fr_fr: Ignoré si ``type = post`` (la distribution normale est utilisée).

source: In PEST parlance "observations" correspond to measurements already made (usually with weight > 0), and "predictions" (or "forecasts") correspond to data we intend to forecast (with weight = 0).
fr_fr: Dans la terminologie utilisée par PEST les "observations" correspondent à mesures déjà réalisées (d'habitude avec un poids > 0), et les "prédictions" (ou "prévisions") correspondent aux données que nous voulons prédire (avec poids = 0).

source: In Windows, to use ``pip`` to install the required packages, please verify that the path to ``pip``'s executable file has been added correctly to your environment variable ``PATH``.
fr_fr: Sous Windows, pour utiliser ``pip`` pour installer les paquets requis, veuillez vérifier que le chemin au fichier exécutable de ``pip`` a été ajouté correctement à votre variable d'environnement ``PATH``.

source: In a complex nonlinear environmental models, instead, the previous rule is not applicable and more sophisticated methods are necessary.
fr_fr: En modèles environnementaux complexes non linéaires, par contre, la règle précédente n'est pas applicable et il faut utiliser des méthodes plus sophistiquées.

source: In a linear system of equations, parameter values are identifiable when the number of unknowns is less than the number of observations.
fr_fr: Dans un système linéaire d'équations, les valeurs des paramètres sont identifiables quand le nombre d'inconnues est moins que le nombre d'observations.

source: In a sense, rather than confirming the model validity, the objective of validation may be seen as an attempt to falsify the model, to find areas where it needs improvement.
fr_fr: Dans un certain sens, plutôt que confirmer la validité du modèle, l'objectif de la validation peut être considéré comme un essai de falsifier le modèle, pour trouver des aires où il a besoin d'amélioration.

source: In addition, :mod:`cuspy` relies on the use of the PEST++ executables.
fr_fr: De plus, :mod:`cuspy` utilise les exécutables de PEST++.

source: In addition, a certain number of useful files is written by PEST++.
fr_fr: De plus, un a certain nombre de fichiers utiles sont écrits par PEST++.

source: In addition, if `ptl_avg` is specified, another series of files is created, which contains the partial averages of one variable (`vpa`) by percentile group of another variable (`v`).
fr_fr: De plus, si `ptl_avg` est spécifiée, une autre série de fichiers est créée, contenant les moyennes partielles d'une variable (`vpa`) par groupe de percentile d'une autre variable (`v`).

source: In addition, linear regression models may be used to assess the degree of linearity of a model.
fr_fr: De plus, les modèles de régression linéaire peuvent être utilisés pour évaluer le dégrée de linéarité d'un modèle.

source: In addition, measurements capture the state of the system in a limited way: they are subject to measurement error and there may be limitations in spatial or temporal resolution.
fr_fr: De plus, les mesures capturent l'état du système de façon limitée : elles sont susceptibles d'erreurs de mesure et il peut y avoir de limitations à la résolution spatiale ou temporelle.

source: In addition, the `pestpp_cmd` output files are written in the folder containing the `pst_file`.
fr_fr: De plus, les fichiers de sortie de `pestpp_cmd` sont écrit dans le dossier qui contient le `pst_file`.

source: In addition, the package has been specially designed to work with dynamic models the output of which is in several columns, the first of which is date.
fr_fr: De plus, le paquet a été spécialement désigné pour travailler avec des modèles dynamiques avec un retour sur plusieurs colonnes, la première desquelles est la date.

source: In all cases calculations can be parallelized using the argument ``parallel=True``.
fr_fr: Dans tous les cas les calculs peuvent être parallélisés en utilisant l'argument ``parallel=True``.

source: In fact, a model is an incomplete representation of reality that uses approximations and assumptions.
fr_fr: En fait, un modèle est une représentation incomplète de la réalité qui utilise des approximations et des suppositions.

source: In fact, the model will not be able to reproduce a behaviour that has not been specified in its code.
fr_fr: En fait, le modèle ne sera pas capable de reproduire un comportement que n'a pas été spécifié dans son code.

source: In fact, the package :mod:`cuspy` has been designed with the objective of facilitating the application of :mod:`pyemu` and PEST++ functionalities to the water temperature models and hydrological models implemented with the packages :mod:`okplm`, :mod:`glmtools` and :mod:`tributary`.
fr_fr: En fait, le paquet :mod:`cuspy` a été désigné avec l'objective de faciliter l'application des fonctionnalités de :mod:`pyemu` et PEST++ aux modèles de température de l'eau et hydrologiques implémentés dans les paquets :mod:`okplm`, :mod:`glmtools` et :mod:`tributary`.

source: In fact, the variability of estimated water temperature in spring and autumn seems too large.
fr_fr: En fait, la variabilité de la température de l'eau estimée du printemps et automne semble trop large.

source: In fact, this parameter corresponds to the lower asymptote of the logistic curve, but there are few low temperature measurements to inform this parameter.
fr_fr: En fait, ce paramètre correspond à l'asymptote inférieure de la courbe logistique, mais il y a peu de mesures des basses températures qui puissent apporter information à ce paramètre.

source: In order to guard against model and data imperfections it is best practice to estimate and communicate uncertainty.
fr_fr: De façon à se protéger des imperfections du modèle et des données il est une pratique exemplaire d'estimer et communiquer l'incertitude.

source: In order to help the user understand better the utilisation and functionalities of this package, we make a short introduction to calibration and uncertainty analysis.
fr_fr: De façon à aider l'utilisateur à mieux comprendre l'utilisation et fonctionnalités de ce paquet, nous faisons une petite introduction à la calibration et l'analyse d'incertitudes.

source: In other cases, it may not be possible to distinguish between several overlapping processes from the available data.
fr_fr: Dans d'autres cas, il peut être difficile de distinguer plusieurs procès qui se superposent depuis les données disponibles.

source: In other words, it tackles the problem of whether the right *type* of data is available to estimate the desired parameter values." Guillaume et al.
fr_fr: Dit autrement, elle s'occupe du problème de si des données du *type* correcte sont disponibles pour estimer les valeurs des paramètres souhaitées." Guillaume et al.

source: In other words, sensitivity analysis is the analysis of how the model's output varies with variations in the parameter values.
fr_fr: Dit autrement, l'analyse de sensitivité est l'analyse de comment varie le retour du modèle en fonction des variations des valeurs des paramètres.

source: In our example, the parameters :math:`\alpha` and :math:`\beta` are the most influential parameters: fixing the value of one of them would reduce the output variance by more than 50%.
fr_fr: Dans notre exemple, les paramètres :math:`\alpha` et :math:`\beta` sont les paramètres les plus influents : la fixation de la valeur d'un entre eux réduirait la variance des sorties de plus d'un 50 %.

source: In our study case, we would need 2 singular values according to the 90% energy criterion.
fr_fr: Dans notre cas d'étude, il nous faudrait 2 valeurs singulières d'après le critère du 90 % d'énergie.

source: In particular, it must be possible to execute the model using a command line instruction of the type:
fr_fr: En particulier, il doit être possible d'exécuter le modèle en utilisant une commande en ligne de commandes comme la suivante :

source: In particular, standardized regression coefficients (SRC) indicate the contribution of the variance of each input factor to the model output variance.
fr_fr: En particulier, les coefficients de régression standardisés (SRC) indiquent la contribution de la variance de chaque facteur d'entrée sur la variance du retour du modèle.

source: In posterior iterations, when we have acquired more data and the uncertainty about the parameter values has decreased enough (and the response of the model can be assumed to be linear), we can use less costly linear methods.
fr_fr: En itérations postérieures, quand on a obtenu plus de données et l'incertitude des valeurs des paramètres a diminué assez (et la réponse du modèle peut être considéré linéaire), on peut utiliser des méthodes linéaires moins coûteux.

source: In such cases, global calibration methods (such as Differential Evolution) may be more appropriate.
fr_fr: Dans de tels cas, les méthodes globales de calibration (telle que l'Évolution Différentielle) peuvent être préférables.

source: In the example above, ``par_data_file`` is a text file separated by spaces containing the data of the parameter section of the PEST control file.
fr_fr: Dans l'exemple ci-dessus, ``par_data_file`` est un fichier texte séparé par des espaces qui contiennent les données de la section des paramètres du fichier de contrôle de PEST.

source: In the next figure we show data worth as the percent uncertainty increase when removing an observation for two forecasts, for 1 January 2015 and for 1 July 2015.
fr_fr: La figure suivante montre la valeur des données comme le pourcentage d'incrément de l'incertitude quand on élimine une observation pour deux prévisions, celles du 1 janvier 2015 et du 1 juillet 2015.

source: In the previous example, we can notice the following facts:
fr_fr: Dans l'exemple antérieur, on peut noter deux points :
